#### Week 2 - Data Analysis with Pandas

# Lesson 2: Introduction to Pandas

Project Challenges:  Reading data with pandas

1.Download the Jupyter notebook and save in notebook folder

2.Download the yob files and save in lessonsâ€™ datafolder

3.Open the notebook in Jupyter

4.Execute the commands

Related files
- pandas_inspecting_data.ipynb (10 KB)
- yob1880.txt (24 KB)
- yob2000.txt (376 KB)

In [4]:
import pandas as pd

In [11]:
df_1880 = pd.read_csv('yob1880.csv')

In [12]:
df_1880.head()

        Mary  F  7065
0       Anna  F  2604
1       Emma  F  2003
2  Elizabeth  F  1939
3     Minnie  F  1746
4   Margaret  F  1578

In [19]:
df_1880.shape

(29776, 3)

In [20]:
df_1880.columns

Index(['Emily', 'F', '25957'], dtype='object')

In [21]:
df_1880.columns[0]

'Emily'

In [22]:
df_1880.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29776 entries, 0 to 29775
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Emily   29776 non-null  object
 1   F       29776 non-null  object
 2   25957   29776 non-null  int64
dtypes: int64(1), object(2)
memory usage: 698.0+ KB

In [25]:
path_to_file_1880 = ('yob1880.csv')
df_1880 = pd.read_csv(path_to_file_1880, names =['name', 'gender', 'frequency'])
df_1880.head()

        name gender  frequency
0       Mary      F       7065
1       Anna      F       2604
2       Emma      F       2003
3  Elizabeth      F       1939
4     Minnie      F       1746

In [28]:
df_1880.shape

(2000, 3)

In [30]:
df_1880.to_csv('./df_1880.csv', index=False)

In [31]:
df_1880_new = pd.read_csv('./df_1880.csv')
df_1880_new.head()

        name gender  frequency
0       Mary      F       7065
1       Anna      F       2604
2       Emma      F       2003
3  Elizabeth      F       1939
4     Minnie      F       1746

In [16]:
df_2000 = pd.read_csv('yob2000.csv')

In [17]:
df_2000.head()

     Emily  F  25957
0   Hannah  F  23084
1  Madison  F  19968
2   Ashley  F  17997
3    Sarah  F  17706
4   Alexis  F  17630

In [33]:
df_2000.shape

(29776, 3)

In [34]:
df_2000.columns

Index(['Emily', 'F', '25957'], dtype='object')

In [35]:
df_2000.columns[0]

'Emily'

In [36]:
df_2000.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29776 entries, 0 to 29775
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Emily   29776 non-null  object
 1   F       29776 non-null  object
 2   25957   29776 non-null  int64
dtypes: int64(1), object(2)
memory usage: 698.0+ KB

In [37]:
path_to_file_2000 = ('yob1880.csv')
df_2000 = pd.read_csv(path_to_file_2000, names =['name', 'gender', 'frequency'])
df_2000.head()

        name gender  frequency
0       Mary      F       7065
1       Anna      F       2604
2       Emma      F       2003
3  Elizabeth      F       1939
4     Minnie      F       1746

In [38]:
df_2000.shape

(2000, 3)

In [39]:
df_2000.to_csv('./df_2000.csv', index=False)

In [40]:
df_2000_new = pd.read_csv('./df_2000.csv')
df_2000_new.head()

        name gender  frequency
0       Mary      F       7065
1       Anna      F       2604
2       Emma      F       2003
3  Elizabeth      F       1939
4     Minnie      F       1746